src/Documents/ОприходованиеОстатков/ОприходованиеОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеОстатков</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <tabularSections>
    <name>МатериальныеЦенности</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоСклад</name>
      <type>
        <types>CatalogRef.Места_Объекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕденицаИзмерений</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ОприходованиеОстатков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура МатериальныеЦенностиГруппаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСправНоменклатураГрупп");
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиГруппаНоменклатурыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиГруппаНоменклатурыОткрытие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиНоменклатураНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОжь;
	ОписаФормы = Новый ОписаниеОповещения("ПослеЗакрытияФормы",ЭтаФорма);
	ПарамФормы = Новый Структура("Ссылка",Элементы.МатериальныеЦенности.ТекущиеДанные.ГруппаНоменклатуры);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораЭлементаСОтбором",ПарамФормы,ЭтаФорма,,,,ОписаФормы);
КонецПроцедуры

&НаКлиенте
Процедура   ПослеЗакрытияФормы(ПараметрыВыбора,ИсточникВыбора) Экспорт
	Элементы.МатериальныеЦенности.ТекущиеДанные.Номенклатура= ПараметрыВыбора;
	Элементы.МатериальныеЦенности.ТекущийЭлемент = Элементы.МатериальныеЦенностиМестоСклад;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиКоличествоПриИзменении(Элемент)
	Тел = Элементы.МатериальныеЦенности.ТекущиеДанные;  
	ОМ_Клиент.ВозвратСуммы(Тел);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиЦенаПриИзменении(Элемент)
	//Тел = Элементы.МатериальныеЦенности.ТекущиеДанные;  
	ОМ_Клиент.ВозвратСуммы(Элементы.МатериальныеЦенности.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиСуммаПриИзменении(Элемент)
	Тел = Элементы.МатериальныеЦенности.ТекущиеДанные;  
	Тел.Цена = Тел.Сумма / Тел.Количество;
КонецПроцедуры
